[Killed] BlockStatement
core/auth.js:4:19
 // auth.js
 
 class Auth {
-    constructor() {
-      this.users = [];
-      this.currentUser = null;
-    }
+    constructor() {}
   
     registerUser(username, password) {
killedBy: Unit Test - Authentication Operations should register a new user
statusReason: Cannot read properties of undefined (reading 'some')

[Killed] BlockStatement
core/auth.js:9:38
       this.currentUser = null;
     }
   
-    registerUser(username, password) {
-      if (this.users.some(user => user.username === username)) {
-        throw new Error('Username already exists');
-      }
-  
-      this.users.push({ username, password });
-    }
+    registerUser(username, password) {}
   
     loginUser(username, password) {
killedBy: Unit Test - Authentication Operations should register a new user
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

+ []
- [
-   {
-     password: 'password123',
-     username: 'user1'

[Killed] EqualityOperator
core/auth.js:10:35
     }
   
     registerUser(username, password) {
-      if (this.users.some(user => user.username === username)) {
+      if (this.users.some(user => user.username !== username)) {
         throw new Error('Username already exists');
       }
killedBy: Unit Test - Authentication Operations should throw an error with a specific message when registering a duplicate username
statusReason: 'Expected an error to be thrown for duplicate username' == 'Username already exists'

[Killed] ConditionalExpression
core/auth.js:10:11
     }
   
     registerUser(username, password) {
-      if (this.users.some(user => user.username === username)) {
+      if (false) {
         throw new Error('Username already exists');
       }
killedBy: Unit Test - Authentication Operations should throw an error with a specific message when registering a duplicate username
statusReason: 'Expected an error to be thrown for duplicate username' == 'Username already exists'

[Killed] BlockStatement
core/auth.js:17:35
       this.users.push({ username, password });
     }
   
-    loginUser(username, password) {
-      const user = this.users.find(user => user.username === username);
-  
-      if (user && user.password === password) {
-        this.currentUser = username;
-        return true;
-      }
-  
-      return false;
-    }
+    loginUser(username, password) {}
   
     logoutUser() {
killedBy: Unit Test - Authentication Operations should log in a registered user with correct credentials
statusReason: undefined == true

[Killed] EqualityOperator
core/auth.js:18:44
     }
   
     loginUser(username, password) {
-      const user = this.users.find(user => user.username === username);
+      const user = this.users.find(user => user.username !== username);
   
       if (user && user.password === password) {
killedBy: Unit Test - Authentication Operations should log in a registered user with correct credentials
statusReason: false == true

[Killed] ArrowFunction
core/auth.js:18:36
     }
   
     loginUser(username, password) {
-      const user = this.users.find(user => user.username === username);
+      const user = this.users.find(() => undefined);
   
       if (user && user.password === password) {
killedBy: Unit Test - Authentication Operations should log in a registered user with correct credentials
statusReason: false == true

[Killed] ConditionalExpression
core/auth.js:20:11
     loginUser(username, password) {
       const user = this.users.find(user => user.username === username);
   
-      if (user && user.password === password) {
+      if (true) {
         this.currentUser = username;
         return true;
killedBy: Unit Test - Authentication Operations should not log in with incorrect credentials
statusReason: true == false

[Killed] EqualityOperator
core/auth.js:20:19
     loginUser(username, password) {
       const user = this.users.find(user => user.username === username);
   
-      if (user && user.password === password) {
+      if (user && user.password !== password) {
         this.currentUser = username;
         return true;
killedBy: Unit Test - Authentication Operations should log in a registered user with correct credentials
statusReason: false == true

[Killed] BooleanLiteral
core/auth.js:22:16
   
       if (user && user.password === password) {
         this.currentUser = username;
-        return true;
+        return false;
       }
   
killedBy: Unit Test - Authentication Operations should log in a registered user with correct credentials
statusReason: false == true

[Killed] BlockStatement
core/auth.js:28:18
       return false;
     }
   
-    logoutUser() {
-      this.currentUser = null;
-    }
+    logoutUser() {}
   
     isAuthenticated() {
killedBy: Unit Test - Authentication Operations should log out a logged-in user
statusReason: true == false

[Killed] BlockStatement
core/auth.js:32:23
       this.currentUser = null;
     }
   
-    isAuthenticated() {
-      return this.currentUser !== null;
-    }
+    isAuthenticated() {}
   }
   
killedBy: Unit Test - Authentication Operations should log in a registered user with correct credentials
statusReason: undefined == true

[Killed] ConditionalExpression
core/auth.js:33:14
     }
   
     isAuthenticated() {
-      return this.currentUser !== null;
+      return false;
     }
   }
killedBy: Unit Test - Authentication Operations should log in a registered user with correct credentials
statusReason: false == true

[Killed] EqualityOperator
core/auth.js:33:14
     }
   
     isAuthenticated() {
-      return this.currentUser !== null;
+      return this.currentUser === null;
     }
   }
killedBy: Unit Test - Authentication Operations should log in a registered user with correct credentials
statusReason: false == true
