[Killed] BlockStatement
core/animal.js:2:21
 class Animal {
-  constructor(name) {
-    this.name = name;
-  }
+  constructor(name) {}
 
   makeSound() {
killedBy: Mutation Integration Testing should create a Cat, make a meow sound, and introduce itself
statusReason: expected 'I am a Tabby cat named undefined' to equal 'I am a Tabby cat named Whiskers'

[Killed] BlockStatement
core/animal.js:6:15
     this.name = name;
   }
 
-  makeSound() {
-    return "Generic animal sound";
-  }
+  makeSound() {}
 }
 
killedBy: Mutation Integration Testing should create an Animal and make a generic sound
statusReason: expected undefined to equal 'Generic animal sound'

[Killed] StringLiteral
core/animal.js:7:12
   }
 
   makeSound() {
-    return "Generic animal sound";
+    return "";
   }
 }
killedBy: Mutation Integration Testing should create an Animal and make a generic sound
statusReason: expected '' to equal 'Generic animal sound'
