[Killed] BlockStatement
core/cart.js:4:19
 // cart.js
 
 class ShoppingCart {
-    constructor() {
-      this.items = [];
-    }
+    constructor() {}
   
     addItem(item) {
killedBy: Unit Test - Shopping Cart should handle removing an existing item from the cart
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
core/cart.js:8:19
       this.items = [];
     }
   
-    addItem(item) {
-      this.items.push(item);
-    }
+    addItem(item) {}
   
     removeItem(item) {
killedBy: Unit Test - Shopping Cart should handle removing an existing item from the cart
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

+ []
- [
-   {
-     name: 'Product 2',
-     price: 30

[Killed] BlockStatement
core/cart.js:12:22
       this.items.push(item);
     }
   
-    removeItem(item) {
-      const index = this.items.indexOf(item);
-      if (index !== -1) {
-        this.items.splice(index, 1);
-      }
-    }
+    removeItem(item) {}
   
     calculateTotal() {
killedBy: Unit Test - Shopping Cart should handle removing an existing item from the cart
statusReason: Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
+   {
+     name: 'Product 1',
+     price: 20
+   },

[Killed] UnaryOperator
core/cart.js:14:21
   
     removeItem(item) {
       const index = this.items.indexOf(item);
-      if (index !== -1) {
+      if (index !== +1) {
         this.items.splice(index, 1);
       }
killedBy: Unit Test - Shopping Cart should not modify the cart if the item to remove is not present
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

+ []
- [
-   {
-     name: 'Product 1',
-     price: 20

[Killed] BlockStatement
core/cart.js:14:25
   
     removeItem(item) {
       const index = this.items.indexOf(item);
-      if (index !== -1) {
-        this.items.splice(index, 1);
-      }
+      if (index !== -1) {}
     }
   
killedBy: Unit Test - Shopping Cart should handle removing an existing item from the cart
statusReason: Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  [
+   {
+     name: 'Product 1',
+     price: 20
+   },

[Killed] BlockStatement
core/cart.js:19:22
       }
     }
   
-    calculateTotal() {
-      return this.items.reduce((total, item) => total + item.price, 0);
-    }
+    calculateTotal() {}
   }
   
killedBy: Integration Test - Shopping Cart Operations should add and remove items, and calculate total price
statusReason: Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    items: [
...
      }
    ],

[Killed] ArithmeticOperator
core/cart.js:20:49
     }
   
     calculateTotal() {
-      return this.items.reduce((total, item) => total + item.price, 0);
+      return this.items.reduce((total, item) => total - item.price, 0);
     }
   }
killedBy: Integration Test - Shopping Cart Operations should add and remove items, and calculate total price
statusReason: Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    items: [
...
      }
    ],

[Killed] ArrowFunction
core/cart.js:20:32
     }
   
     calculateTotal() {
-      return this.items.reduce((total, item) => total + item.price, 0);
+      return this.items.reduce(() => undefined, 0);
     }
   }
killedBy: Integration Test - Shopping Cart Operations should add and remove items, and calculate total price
statusReason: Expected values to be strictly deep-equal:
+ actual - expected ... Lines skipped

  {
    items: [
...
      }
    ],
