[Killed] BlockStatement
core/cat.js:4:28
 const Animal = require("./animal");
 
 class Cat extends Animal {
-  constructor(name, color) {
-    super(name);
-    this.color = color;
-  }
+  constructor(name, color) {}
 
   makeSound() {
killedBy: Mutation Integration Testing should create a Cat, make a meow sound, and introduce itself
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
core/cat.js:9:15
     this.color = color;
   }
 
-  makeSound() {
-    return "Meow";
-  }
+  makeSound() {}
 
   introduce() {
killedBy: Mutation Integration Testing should create a Cat, make a meow sound, and introduce itself
statusReason: expected undefined to equal 'Meow'

[Killed] BlockStatement
core/cat.js:13:15
     return "Meow";
   }
 
-  introduce() {
-    return `I am a ${this.color} cat named ${this.name}`;
-  }
+  introduce() {}
 }
 
killedBy: Mutation Integration Testing should create a Cat, make a meow sound, and introduce itself
statusReason: expected undefined to equal 'I am a Tabby cat named Whiskers'
