[Killed] BlockStatement
core/weather.js:4:17
 // weather.js
 
 class WeatherService {
-  constructor() {
-    this.weatherData = {};
-    this.temperatureHistory = {};
-  }
+  constructor() {}
 
   updateWeatherData(location, temperature, condition) {
killedBy: Integration Test - Weather Service should update and retrieve weather data for a location
statusReason: Cannot set properties of undefined (setting 'Tokyo')

[Killed] BlockStatement
core/weather.js:9:55
     this.temperatureHistory = {};
   }
 
-  updateWeatherData(location, temperature, condition) {
-    // Update current weather data
-    this.weatherData[location] = { temperature, condition };
-
-    // Update temperature history
-    if (!this.temperatureHistory[location]) {
-      this.temperatureHistory[location] = [];
-    }
-    this.temperatureHistory[location].push(temperature);
-  }
+  updateWeatherData(location, temperature, condition) {}
 
   getTemperature(location) {
killedBy: Integration Test - Weather Service should update and retrieve weather data for a location
statusReason: null == 22

[Killed] ConditionalExpression
core/weather.js:14:9
     this.weatherData[location] = { temperature, condition };
 
     // Update temperature history
-    if (!this.temperatureHistory[location]) {
+    if (false) {
       this.temperatureHistory[location] = [];
     }
killedBy: Integration Test - Weather Service should update and retrieve weather data for a location
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
core/weather.js:14:45
     this.weatherData[location] = { temperature, condition };
 
     // Update temperature history
-    if (!this.temperatureHistory[location]) {
-      this.temperatureHistory[location] = [];
-    }
+    if (!this.temperatureHistory[location]) {}
     this.temperatureHistory[location].push(temperature);
   }
killedBy: Integration Test - Weather Service should update and retrieve weather data for a location
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] ArrayDeclaration
core/weather.js:15:43
 
     // Update temperature history
     if (!this.temperatureHistory[location]) {
-      this.temperatureHistory[location] = [];
+      this.temperatureHistory[location] = ["Stryker was here"];
     }
     this.temperatureHistory[location].push(temperature);
killedBy: Integration Test - Weather Service should handle getting average temperature for a location in integration test
statusReason: NaN == 20

[Killed] BlockStatement
core/weather.js:20:28
     this.temperatureHistory[location].push(temperature);
   }
 
-  getTemperature(location) {
-    return this.weatherData[location] ? this.weatherData[location].temperature : null;
-  }
+  getTemperature(location) {}
 
   getCondition(location) {
killedBy: Integration Test - Weather Service should update and retrieve weather data for a location
statusReason: undefined == 22

[Killed] BlockStatement
core/weather.js:24:26
     return this.weatherData[location] ? this.weatherData[location].temperature : null;
   }
 
-  getCondition(location) {
-    return this.weatherData[location] ? this.weatherData[location].condition : null;
-  }
+  getCondition(location) {}
 
   getAverageTemperature(location) {
killedBy: Integration Test - Weather Service should update and retrieve weather data for a location
statusReason: undefined == 'Rainy'

[Killed] BlockStatement
core/weather.js:28:35
     return this.weatherData[location] ? this.weatherData[location].condition : null;
   }
 
-  getAverageTemperature(location) {
-    const temperatures = this.temperatureHistory[location];
-  
-    if (!temperatures) {
-      return null; // No temperature data available
-    }
-  
-    const sum = temperatures.reduce((acc, temperature) => acc + temperature, 0);
-    return sum / temperatures.length;
-  }  
+  getAverageTemperature(location) {}  
 }
 
killedBy: Integration Test - Weather Service should handle getting average temperature for a location in integration test
statusReason: undefined == 20

[Killed] BlockStatement
core/weather.js:31:24
   getAverageTemperature(location) {
     const temperatures = this.temperatureHistory[location];
   
-    if (!temperatures) {
-      return null; // No temperature data available
-    }
+    if (!temperatures) {}
   
     const sum = temperatures.reduce((acc, temperature) => acc + temperature, 0);
killedBy: Unit Test - Weather Service should handle getting average temperature for a location with no temperature history (mutant-killing case 1)
statusReason: Cannot read properties of undefined (reading 'reduce')

[Killed] ConditionalExpression
core/weather.js:31:9
   getAverageTemperature(location) {
     const temperatures = this.temperatureHistory[location];
   
-    if (!temperatures) {
+    if (false) {
       return null; // No temperature data available
     }
killedBy: Unit Test - Weather Service should handle getting average temperature for a location with no temperature history (mutant-killing case 1)
statusReason: Cannot read properties of undefined (reading 'reduce')

[Killed] ArithmeticOperator
core/weather.js:35:59
       return null; // No temperature data available
     }
   
-    const sum = temperatures.reduce((acc, temperature) => acc + temperature, 0);
+    const sum = temperatures.reduce((acc, temperature) => acc - temperature, 0);
     return sum / temperatures.length;
   }  
killedBy: Integration Test - Weather Service should handle getting average temperature for a location in integration test
statusReason: -20 == 20

[Killed] ArrowFunction
core/weather.js:35:37
       return null; // No temperature data available
     }
   
-    const sum = temperatures.reduce((acc, temperature) => acc + temperature, 0);
+    const sum = temperatures.reduce(() => undefined, 0);
     return sum / temperatures.length;
   }  
killedBy: Integration Test - Weather Service should handle getting average temperature for a location in integration test
statusReason: NaN == 20

[Killed] ArithmeticOperator
core/weather.js:36:12
     }
   
     const sum = temperatures.reduce((acc, temperature) => acc + temperature, 0);
-    return sum / temperatures.length;
+    return sum * temperatures.length;
   }  
 }
killedBy: Integration Test - Weather Service should handle getting average temperature for a location in integration test
statusReason: 180 == 20
